src/main/resources/xml/convertTemperatureSoap/convertTemp/convertTemp.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"	xmlns:web="http://www.webserviceX.NET/">
	<soap:Header />
	<soap:Body>
		<web:ConvertTemp>
			<web:Temperature>40</web:Temperature>
			<web:FromUnit>degreeFahrenheit</web:FromUnit>
			<web:ToUnit>degreeCelsius</web:ToUnit>
		</web:ConvertTemp>
	</soap:Body>
</soap:Envelope> 